Repository: vopl/Whitepaper
Catalog: latex/omegat-ru/omegat-ru-level2.tmx
Source language: en_us
Languages: ru

source: 1.\quad Similar to file download, multiple virtual connections (tunnels) are established with each peer, and the estimated transmission speed $V_{conn}$ is calculated per virtual connection.
ru: 1.\quad Аналогично скачиванию файлов, с каждым пиром устанавливается несколько виртуальных соединений (туннелей) и оценивается скорость передачи $V_{conn}$ на каждое виртуальное соединение.

source: 1.\quad Multiple virtual connections (Tunnels) are established between the user and each peer with the resources, to improve transmission efficiency.
ru: 1.\quad Для увеличения эффективности передачи, между пользователем и каждым пиром, обладающим нужными данными, устанавливаются несколько виртуальных соединений (Туннелей).

source: 2.\quad For each peer, an expected download speed $V_{conn}$ is calculated based on its transmission history.
ru: 2.\quad Для каждого пира, на основе его истории передачи вычисляется скорость скачивания $V_{conn}$.

source: 2.\quad Pieces to be downloaded are sorted based on their priorities and pre-allocated to available virtual connections by placing them in the corresponding download queues.
ru: 2.\quad Части к загрузке сортируются на основе их приоритетов и предварительно распределяются по имеющимся виртуальным соединениям, размещаются в соответствующих очередях на скачивание.

source: 3.\quad Step 2 is repeated periodically, and all remaining pieces will be re-allocated to accommodate changes in the transmission speed and availability of the virtual connections.
ru: 3.\quad Шаг 2 повторяется циклически, все оставшиеся части будут пере-распределены в соответствии с изменениями скорости передачи и доступности виртуальных соединений.

source: 3.\quad The number of virtual connections on each peer varies the peer with a higher $V_{conn}$ can have a significant number of initial virtual connections.
ru: 3.\quad Количество виртуальных соединений с каждым пиром различно, пир с высоким $V_{conn}$ может иметь значительное число виртуальных соединений изначально.

source: 4.\quad After a piece is successfully downloaded, the transmission speed of the virtual connection is updated, and a request is sent immediately to download the next piece in the queue.
ru: 4.\quad После успешной загрузки части обновляется оценка скорости передачи виртуального соединения, сразу же отсылается запрос на скачивание следующей части в очереди.

source: 4.\quad Based on the partition of the segment, the user first sends a download request to a given peer for an arbitrary piece, and the peer responds accordingly by sending the user the piece upon receiving the request.
ru: 4.\quad На основании разбиения сегмента пользователь сначала шлет пиру запрос на скачивание какой то конкретной части, при получении запроса пир отвечает пользователю отсылкой соответствующей части.

source: 5.\quad Urgent pieces can be requested from multiple connections to ensure smooth playback.
ru: 5.\quad Для более мягкого воспроизведения, наиболее востребованные части могут быть запрошены сквозь несколько соединений.

source: 5.\quad When a piece is received from a virtual connection, the estimated download speed $V_{conn}$ is updated, and another remaining arbitrary piece will be requested from the connection immediately until all the data is downloaded.
ru: 5.\quad При получении из виртуального соединения запрошенной части производится обновление оценочной скорости скачивания $V_{conn}$, далее немедленно запрашивается какая то другая часть, до тех пор, пока не будут скачаны все данные.

source: 6.\quad Other parts of the algorithm work the same way as in regular file download.
ru: 6.\quad В остальном алгоритм работает так же как и в случае обычного скачивания файлов.

source: 6.\quad When a download request times out, the request is canceled, and all connections to the non-responding peer will be closed.
ru: 6.\quad В случае истечения времени ожидания ответа соответствующий запрос на скачивание отменяется, все соединения к не-отвечающему пиру закрываются.

source: A scheduler decides how the M pieces can be downloaded from the N peers so that the segment can be retrieved in a fast, efficient manner, and avoid duplicated pieces to be downloaded.
ru: Планировщик решает, как M частей могут быть получены от N пиров так чтобы весь сегмент мог быть получен быстро и эффективно, с недопущением пересылки дублируемых частей.

source: A summary of the scheduling algorithm is as follows:
ru: Далее приводится краткая сводка представленного алгоритма планирования:

source: An illustration of the pre-allocation algorithm is shown in Figure 2.1.
ru: На Рисунке 2.1 показан пример действия алгоритма предварительного распределения.

source: An optimized Proof of Space-Time (PoSt) ensures that the specified data is indeed stored by the miner over a period.
ru: Оптимизированное доказательство хранения с течением времени (Оptimized Proof of Space-Time, PoSt) убеждает что заданные данные действительно сохранены майнером в течении периода времени.

source: As Protocol Labs claims that files stored on IPFS are permanent and cannot be deleted, it runs the risks of legal battles against policies and regulations and makes its worldwide deployment much more difficult.
ru: Как заявляет Protocol Labs, файлы, размещенные в IPFS являются перманентными, не могут быть удалены, что может приводить к юридическим битвам в аспекте государственных политик и регуляторов, глобальное распространение файлов становится намного более сложным.

source: As a result, a large, high-quality miner community can be established and kept growing.
ru: В результате может быть сформировано большое и качественное сообщество майнеров.

source: At the same time, PPIO also offers better data security and privacy protection.
ru: В то же время, PPIO предлагает лучшую защиту в аспектах безопасности и приватности.

source: At the same time, PPIO's design also includes a mechanism to protect users from the impact of storage price fluctuations, which provides a better user experience than existing centralized storage platforms and more importantly much lower price.
ru: Так же, ахитектура PPIO включает механизм противостояния колебаниям цены хранения, предоставляющий пользователям лучший вариант чем существующие централизованные платформы хранения и, что не менее важно, по намного меньшей цене.

source: At the same time, high bandwidth and storage cost is another inherent problem of the centralized storage systems, it leads to unaffordable price and makes it extremely difficult for many Internet companies to be profitable.
ru: Так же, другой проблемой централизованных систем хранения является высокая стоимость каналов связи и хранилищ, она приводит к неприемлемой цене и делает крайне сложным прибыльность для многих Интернет-компаний.

source: At the same time, it allows the user to easily share their data to the public or within a private group.
ru: В то же время, они позволяют пользователю делиться данными публично или в приватной группе.

source: At the same time, it punishes misbehaving participants.
ru: В то же время, они наказывают неадекватных участников.

source: Based on the experience of building the high-performing P2P network, PPIO's design allows multiple connections to be established from each peer.
ru: С учетом опыта разработки высоко производительных одноранговых сетей, PPIO спроектирована таким образом чтобы с каждым пиром устанавливалось множество соединений.

source: Besides a set of industry proven P2P transmission technologies, the team also developed data-driven scheduling, a self-organizing overlay network, and optimized content distribution network.
ru: Наряду с множеством проверенных в промышленных условиях одноранговых технологий передачи, команда так же разработала планировщик, управляемый данными (data-driven scheduling), самоорганизующуюся оверлейную сеть и сеть оптимального распространения контента.

source: Besides, some of its storage proofs are too complex and likely to hold the system back from running efficiently at a large scale.
ru: Кроме того, некоторые из криптомеханизмы слишком сложны и предположительно будут негативно сказываться при большом масштабе системы.

source: BurstCoin utilizes Proof of Capacity (PoC) that does take storage capacity of the miners into account, but unfortunately, it is not enough to serve well for the storage requirements.
ru: BurstCoin использует Proof of Capacity (PoC), учитывающий размер хранилищ майнеров, но, к сожалению, этого не достаточно для нормального функционирования хранилища с выполнением всех требований к нему.

source: By leveraging the experience, PPIO's P2P network is designed to be a robust, scalable and high-performing data storage and transmission system.
ru: С учетом этого опыта, одноранговая сеть PPIO спроектирована робастной, масштабируемой быстродействующей системой хранения и передачи данных.

source: By using data sharding and encryption algorithms, user's data can only be retrieved by the one who possesses the user's unique private key.
ru: За счет алгоритмов шардинга и шифрования, пользовательские данные могут быть получены только обладателем приватного ключа пользователя.

source: Combined with its innovation in NAT Traversal, Kademlia distributed hash table (DHT), lightweight storage consensus proof and optimized transmission for media streaming, PPIO's distributed storage network can perform with extremely high efficiency and can be easily scaled to hundreds of millions of network nodes.
ru: Комбинируя свои иннвации с такими технологиями как обход NAT (NAT Traversal), распределенные хэш-таблицы (DHT) Kademlia, облегченное доказательство консенсуса хранилища и оптимизированное потоковое вещание медиа, распределенная сеть хранения PPIO может быть крайне эффективной и может быть легко масштабирована на сотни миллионов сетевых узлов.

source: Due to the unique nature of the P2P network, more copies of the data lead to faster download speed.
ru: Из за уникальной особенности одноранговой сети, наличие множества копий данных приводит к более высокой скорости загрузки.

source: Each of these N miners is also called a “Peer”.
ru: Каждый их этих N майнеров так же называется “Пиром (Peer)”.

source: For example, one segment can be partitioned into M pieces, and these pieces can be duplicated and stored by N different storage miners.
ru: Например, один сегмент может быть разбит на M частей, и эти части могут быть продублированы и сохранены в N различных хранилищах майнеров.

source: For example, the Dropbox hacking in 2016 alone leaked 68 million user accounts.
ru: Например, в 2016 году был взломан Dropbox, что привело к утечке 68 миллионов пользовательстких аккаунтов.

source: For that purpose, its file index is made public to facilitate features like Web access, but it poses a challenge to preserving user privacy and data security in a storage network.
ru: Для этой цели индекс файлов делается публичным, что создает возможности наподобие Веб-доступа к файлам, но это, так же, создает проблему сохранения приватности пользователя и безопасности данных в сети.

source: However, a decentralized peer-to-peer network does not rely on any central server to function correctly, and can easily tolerate the fault and failure of some nodes.
ru: Однако, децентрализованная одноранговая сеть не зависит от какого либо центрального сервера для того чтобы корректно функционировать и способна легко переносить ошибки и отказы некоторых узлов.

source: However, the existing centralized solutions have many problems.
ru: Тем не менее, существующие централизованные решения имеют множество проблем.

source: However, the malicious nodes would attempt to cheat the network through various types of attacks, which undermines the system fairness.
ru: Тем не менее, злонамеренные узлы предпринимают попытки причинить вред сети посредством различных типов атак, подрывающих целостность системы.

source: However, these attempts were not successful.
ru: Тем не менее, эти попытки не были успешными.

source: If it fails, TCP based protocols will be used instead to adapt to different types of heterogeneous networks.
ru: Если она оказывается неудачной, для адаптации в различных типах гетерогенных сетей будет использоваться протокол на основе TCP.

source: If no history is found, a default empirical value is used.
ru: В случае отсутствия исторических данных используется эмпирическое значение по умолчанию.

source: In PPIO‘s system, a storage "Object" is divided into "Segments", each "Segment" is further divided into some "Pieces".
ru: В системе PPIO, хранимый "Объект (Object)" разбивается на "Сегменты (Segments)", каждый "Сегмент" далее разбивается на несколько "Честей (Pieces)".

source: In general, pieces with higher priority should end up with an earlier estimated arrival time.
ru: Главное, более приоритетные части должны оканчиваться с более ранним временем доставки.

source: In section 2 of this chapter, PPIO's P2P network design will be explained in details, including its intelligent data-driven scheduling algorithms, its implementation of the Distributed Hash Table (DHT), its traffic management based on Proactive Network Provider Participation (P4P), and its P2P based content distribution technology(PCDN).
ru: В секции 2 данной главы будет детально рассмотрена архитектура одноранговой сети PPIO, включая интеллектуальные алгоритмы планирования предачи данных, основанные на самих данных (ntelligent data-driven scheduling algorithms), реализация распределенной хэш-таблицы (DHT), управление трафиком на основе упредительного учета структуры сети (Proactive Network Provider Participation, P4P), а так же, технологии доставки контента для одноранговых сетей (P2P based content distribution technology, PCDN).

source: In such a network, multiple copies of the data are distributed and stored on many different nodes.
ru: Данные в такой сети распространяются и хранятся в виде множества копий на множестве узлов.

source: In the traditional Client-Server (CS) model, the server can quickly become the network bottleneck when the client population grows.
ru: В традиционной модели клиент-сервер (Client-Server, CS), сервер может быстро стать узким местом в сети при росте популяции клиентов.

source: In this case, the non-responding peer will also be penalized, and the number of connections that can be established from the peer in future downloads is reduced.
ru: В этом случае не-отвечающий пир будет оштрафован, будет уменьшено количество соединений, устанавливаемых к пиру при будущих скачиваниях.

source: In this case, there is a higher chance that necessary pieces are already downloaded to allow the playback to start immediately after seeking.
ru: В этом случае значительно повышается вероятностьтого, что необходимые части уже будут загружены, что позволит начать воспроизведение немедленно после пере-позиционирования.

source: In this chapter, three core technologies behind PPIO will be elaborated:
ru: В данной главе будут рассмотрены три основные технологии, используемые в PPIO:

source: It calculates the power of the miners based on their storage and bandwidth contributions, selects a block producer randomly via Verifiable Random Function (VRF)\cite{article24}\cite{article25}, utilizes Byzantine Fault Tolerance (BFT) based consortium consensus for validation.
ru: Она вычисляет мощность майнеров на основе их вклада в хранение и пропускную способность, затем случайным образом выбирает генератора следующего блока на основании Проверяемой Случайной Функции (Verifiable Random Function,VRF)\cite{article24}\cite{article25}, для проверки которой использоуется консенсус на основе консорциума Византийских Генералов (Byzantine Fault Tolerance, BFT).

source: It does borrow mature P2P system designs from proven applications such as BitTorrent, but it provides no good solution to handle complex network environments and does not offer performance optimization within regional networks.
ru: FileCoin использует архитектуру одноранговых сетей из проверенных временем приложений, таких как BitTorrent, но, не предоставляет решений для сложных сетевых сред и не предлагает скоростных оптимизаций для региональных сетей.

source: It explains how PPIO can prevent various network attacks, and discusses how it establishes a healthy and sustainable incentive mechanism, economic model and ecosystem.
ru: Документ разъясняет как PPIO противостоит различным сетевым атакам, поддерживает работоспособность и устойчивость механизма поощрений, предлагает экономическую модельи экосистему.

source: It improves the efficiency of the network, protects its integrity and enables it to operate in a secure, decentralized manner.
ru: Это увеличивает эффективность сети, защищает ее целостность и позволяет действовать безопасно.

source: It is also the foundation of PPIO's high-volume, large-scale storage market.
ru: Так же, это является основой многообъемного и сильно масштабируемого рынка хранилищ PPIO.

source: It not only provides more robust and efficient services than existing cloud-based storage platforms such as AWS S3 but also significantly reduces the storage cost.
ru: Она не только предоставляет более мощные и эффективные службы, нежели существующие облачные платформы хранения данных, такие как AWS S3, но, так же, значительно снижает стоимость хранения.

source: It provides in-depth details on its distributed file system, network architecture, and storage workflow.
ru: Документ предоставляет низкоуровневую подробную информацию о распределенной файловой системе, архитектуре сети и процесса хранения.

source: It significantly improves the overall transmission efficiency of the network, especially for TCP connections, as it works around the low-efficiency problem caused by TCP's conservative flow control.
ru: Это существенно увеличивает эффективность передачи сети в целом, особенно для TCP соединений, работая как заплатка над проблемой малой эффективности, привносимой консервативным управлением потоком передачи данных в TCP.

source: It significantly improves the robustness of the distributed storage system and allows the client to download data from the closest neighbors on the network.
ru: Это значительно повышает устойчивость системы распределенного хранения и позволяет клиентам получать данные с ближайших соседних узлов в сети.

source: Light Proof of Capacity (LPoC) is developed to provide lightweight validation of storage capacity provided by the miners.
ru: Облегченное доказательство вместимости (Light Proof of Capacity, LPoC) разработано для легкого удостоверения в наличии заданного объема свободного места в распоряжении майнера.

source: Many media streaming applications allow random access playbacks such as fast forwarding or seeking.
ru: Многие приложения медиа-вещания позволяют проигрывание с произвольного места, например для перемотки или поиска.

source: PPIO also has a set of technologies built into better support decentralized applications, including object-based storage, dApp Sandbox mechanisms, and file access management, etc.
ru: PPIO так же имеет некоторые технологии для улучшения поддержки распределенных приложений, включая хранилища объектов, механизм песочницы, управление доступом к файлам и т.п.

source: PPIO has a comprehensive plan to develop a robust, healthy and sustainable ecosystem, to facilitate the development of applications and services, and allow the developers to enjoy real benefits from PPIO's growth.
ru: PPIO имеет обстоятельный план для разработки сильной, живучей и устойчивой экосистемы для разработки приложений и сервисов, и предоставления разработчикам возможности наслаждаться бенефитами роста PPIO.

source: PPIO incentives the nodes based on their contributions of storage and bandwidth, therefore the nodes incline to stay in the network and make a long and reliable contribution \cite{article1}.
ru: PPIO поощряет узлы в зависимости от реализуемых ими ресурсов хранилища и пропускной способности, тем самым узлы стремятся оставаться в сети и производить длительный и стабильный вклад \cite{article1}.

source: PPIO is a programmable decentralized storage and delivery network.
ru: PPIO является программируемой децентрализованной сетью хранения и доставки данных.

source: PPIO is designed from the ground up to perform efficiently on a global scale, by leveraging the founding team's experience from designing and running the decentralized network with hundreds of millions of users.
ru: PPIO спроектирована с нуля для эффективного функционирования в глобальном масштабе, на основании опыта команды разработчиков в проектировании и запуске децентрализованной сети с сотнями миллионов пользователей.

source: PPIO is equipped with practical storage proofs to maintain the integrity and reliability of its storage contents.
ru: Для обеспечения целостности и доступности хранимого контента, PPIO снабжена практичными механизмами доказывания.

source: PPIO meets the storage needs of both today's Internet businesses and services, and the emerging decentralized applications (DApps).
ru: PPIO сводит потребности в хранении данных, имеющиеся у сегодняшнего бизнеса с одной стороны и предлагаемых возможностей поставщиков соответствующих услуг с другой, а так же, предоставляет возможность реализации распределенных приложений (DApps).

source: PPIO's consensus algorithm is designed by its use scenario.
ru: Алгоритм консенсуса PPIO спроектирован в соответствии со сценарием использования самого PPIO.

source: PPIO's data-driven scheduler is designed to provide stable real-time streaming performance in an ad-hoc P2P network\cite{article12}.
ru: Планировщик PPIO, управляемый данными, спроектирован для стабильной работы потокового вещания реального времени в специализированной одноранговой сети\cite{article12}.

source: PPIO's design also improves the efficiency in regional networks and makes it more friendly to ISPs.
ru: Архитектура PPIO, так же, направлена на увеличение эффектирвности работы в региональных сетях, что делает ее более дружелюбной к поставщикам интернета (ISP).

source: PPIO's founding team successfully designed, developed and maintained PPLive, a peer to peer streaming system that serves hundreds of millions of users on a daily basis.
ru: Команда, учредившая и разрабатывающая PPIO успешно спроектировала, разработала и поддерживает PPLive, одноранговую систему вещания, обслуживающую сотни миллионов пользователей ежедневно.

source: PPIO's founding team successfully developed PPLive, and they were also behind its innovative P2P network design and efficient data transmission technologies\cite{article4}\cite{article5}\cite{article6}\cite{article7}.
ru: Команда PPIO ранее успешно разработала проект PPLive, и он так же был основан на инновационном дизайне одноранговой сети и эффективных технологиях передачи данных\cite{article4}\cite{article5}\cite{article6}\cite{article7}.

source: PPIO's unique decentralized file system prevents unauthorized access and ensures that all the data can be stored securely and privately.
ru: Уникальная децентрализованная файловая система PPIO предоствращает неавторизованный доступ и гарантирует безопасность и приватность хранения данных.

source: PPIO's well-designed decentralized storage network and incentive mechanism allows it to make use of the vast amount of unused bandwidth and storage resources on the Internet, and provide reliable storage service at much lower cost.
ru: Грамотно продуманная распределенная сеть хранения и механизм поощрения позволяют PPIO использовать значительный объем неиспользованной полосы пропускания и ресурсы хранилищ в сети Интернет, а так же, предоставлять надежные услуги хранения с намного меньшей ценой.
